In [1]:
import pandas as pd

In [2]:
# read the data_1_env.csv file
df1=pd.read_csv('data_1_env.csv')
df1.head()

,Year,Location,Avg Min Temp *F,Yr Rain inches,Heat Wave,Dry Spell,Cold Wave,Wet Spell
0,1980,Lake Diane,68.36,28.8079,N,N,Y,N
1,1980,Hillport,73.58,24.3217,N,N,Y,N
2,1980,Spencerborough,69.98,46.0992,N,N,N,N
3,1981,Lake Diane,67.28,31.2477,No,N,Y,N
4,1981,Hillport,73.58,24.2776,N,N,Y,N

In [3]:
df1.describe()

              Year  Avg Min Temp *F  Yr Rain inches
count    45.000000        45.000000       45.000000
mean   1987.000000        71.060000       40.019731
std       4.369314         2.320407       11.572000
min    1980.000000        67.280000       23.404300
25%    1983.000000        69.080000       30.281500
50%    1987.000000        70.340000       38.627200
75%    1991.000000        73.760000       52.552000
max    1994.000000        74.840000       60.822900

In [4]:
# read the data_2_env.csv file
df2=pd.read_csv('data_2_env.csv')
df2.head()

,Year,Location,Avg Min Temp *C,Yr Rain mm,Heat Wave,Dry Spell,Cold Wave,Wet Spell
0,1995,Hillport,23.9,741.74,N,Y,N,N
1,1995,Spencerborough,21.8,1425.32,N,N,N,N
2,1995,Lake Diane,21.2,1199.91,N,N,N,Y
3,1996,Lake Diane,21.1,1182.85,N,N,N,Y
4,1996,Hillport,23.6,837.42,N,N,N,N

In [5]:
df2.describe()

              Year  Avg Min Temp *C   Yr Rain mm
count    75.000000        75.000000    75.000000
mean   2007.000000        22.788000  1371.774533
std       7.259663         1.227276   349.268568
min    1995.000000        20.900000   741.740000
25%    2001.000000        21.900000  1084.025000
50%    2007.000000        22.400000  1381.230000
75%    2013.000000        23.950000  1632.065000
max    2019.000000        25.300000  2155.300000

###### Need to convert Avg Min Temp *F and Yr Rain inches  in data-1-env.csv to Avg Min Temp *C and Yr Rain mm. save to data-1-copy-env.csv

In [6]:
# read the csv file
data = pd.read_csv('data_1_env.csv')

# convert F to c and yr inches to yr mm
col_name = 'Avg Min Temp *F'
data[col_name] = (data[col_name]-32)*5/9

col_name2 = 'Yr Rain inches'
data[col_name2] = data[col_name2] * 25.4



# rename the column
data.rename(columns={'Avg Min Temp *F': 'Avg Min Temp *C'}, inplace=True)
data.rename(columns={'Yr Rain inches': 'Yr Rain mm'}, inplace=True)

# save the updated file
data.to_csv('data-1-copy-env.csv', index=False)

data.head()

,Year,Location,Avg Min Temp *C,Yr Rain mm,Heat Wave,Dry Spell,Cold Wave,Wet Spell
0,1980,Lake Diane,20.2,731.72066,N,N,Y,N
1,1980,Hillport,23.1,617.77118,N,N,Y,N
2,1980,Spencerborough,21.1,1170.91968,N,N,N,N
3,1981,Lake Diane,19.6,793.69158,No,N,Y,N
4,1981,Hillport,23.1,616.65104,N,N,Y,N

###### combine new file and data_2_env.csv

In [7]:
df1 = pd.read_csv('data-1-copy-env.csv')
df2 = pd.read_csv('data_2_env.csv')

combined_df = pd.concat([df1, df2], ignore_index=True)

combined_df.to_csv('combine.csv', index=False)

In [8]:
# read the data_clean.csv file
df=pd.read_csv('combine.csv')
df.head()

,Year,Location,Avg Min Temp *C,Yr Rain mm,Heat Wave,Dry Spell,Cold Wave,Wet Spell
0,1980,Lake Diane,20.2,731.72066,N,N,Y,N
1,1980,Hillport,23.1,617.77118,N,N,Y,N
2,1980,Spencerborough,21.1,1170.91968,N,N,N,N
3,1981,Lake Diane,19.6,793.69158,No,N,Y,N
4,1981,Hillport,23.1,616.65104,N,N,Y,N

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Year             120 non-null    int64
 1   Location         120 non-null    object
 2   Avg Min Temp *C  120 non-null    float64
 3   Yr Rain mm       120 non-null    float64
 4   Heat Wave        120 non-null    object
 5   Dry Spell        120 non-null    object
 6   Cold Wave        120 non-null    object
 7   Wet Spell        120 non-null    object
dtypes: float64(2), int64(1), object(5)
memory usage: 7.6+ KB

In [10]:
df.isnull().sum()

Year               0
Location           0
Avg Min Temp *C    0
Yr Rain mm         0
Heat Wave          0
Dry Spell          0
Cold Wave          0
Wet Spell          0
dtype: int64

In [11]:
df.duplicated().sum()

0

In [12]:
df.describe()

              Year  Avg Min Temp *C   Yr Rain mm
count   120.000000       120.000000   120.000000
mean   1999.500000        22.380000  1238.547022
std      11.591797         1.353092   370.990127
min    1980.000000        19.600000   594.469220
25%    1989.750000        21.300000   932.147615
50%    1999.500000        22.200000  1179.980000
75%    2009.250000        23.400000  1477.920000
max    2019.000000        25.300000  2155.300000

In [13]:
df3 = pd.read_csv('data_3_crop.csv')
df3.head()

,Year,Location,Irrigation,Crop Type,Crop Damage,Yield,Observer
0,1980.0,Lake Diane,Y,Barley,1.0,1618.37,Mark Henderson
1,1980.0,Hillport,Y,Barley,1.0,1728.69,Jacqueline Jones
2,1980.0,Spencerborough,N,Barley,0.0,1496.14,Rita Curry
3,1981.0,Lake Diane,Y,Oats,1.0,887.85,Karen Moreno
4,1981.0,Hillport,Y,Oats,1.0,1028.50,Katie Martinez

In [14]:
df3.duplicated().sum()

0

In [15]:
df3.isnull().sum()

Year           1
Location       1
Irrigation     1
Crop Type      1
Crop Damage    1
Yield          1
Observer       1
dtype: int64

###### Null values remove

In [16]:
df3 = df3.dropna()

In [17]:
df3.describe()

              Year  Crop Damage        Yield
count   120.000000   120.000000   120.000000
mean   1999.500000     0.283333  1285.043583
std      11.591797     0.452506   295.511551
min    1980.000000     0.000000   774.210000
25%    1989.750000     0.000000  1043.670000
50%    1999.500000     0.000000  1353.945000
75%    2009.250000     1.000000  1480.900000
max    2019.000000     1.000000  1771.760000

###### Drop Year and Location in data_3_crop.csv

In [18]:
df3=df3.drop(['Year', 'Location'], axis=1)
df3.head()

  Irrigation Crop Type  Crop Damage    Yield          Observer
0          Y    Barley          1.0  1618.37    Mark Henderson
1          Y    Barley          1.0  1728.69  Jacqueline Jones
2          N    Barley          0.0  1496.14        Rita Curry
3          Y      Oats          1.0   887.85      Karen Moreno
4          Y      Oats          1.0  1028.50    Katie Martinez

###### replays Y and N

In [19]:
df['Heat Wave'].unique()

array(['N', 'No', '0', 'Y', 'n', '1', 'no'], dtype=object)

In [20]:
df['Heat Wave'] = df['Heat Wave'].replace('Yes','Y')
df['Heat Wave'] = df['Heat Wave'].replace('No','N')
df['Heat Wave'] = df['Heat Wave'].replace('1','Y')
df['Heat Wave'] = df['Heat Wave'].replace('0','N')
df['Heat Wave'] = df['Heat Wave'].replace('n','N')
df['Heat Wave'] = df['Heat Wave'].replace('no','N')

In [21]:
df['Dry Spell'].unique()

array(['N', 'no', 'n', 'No', 'Y', '0'], dtype=object)

In [22]:
df['Dry Spell'] = df['Dry Spell'].replace('Yes','Y')
df['Dry Spell'] = df['Dry Spell'].replace('No','N')
df['Dry Spell'] = df['Dry Spell'].replace('1','Y')
df['Dry Spell'] = df['Dry Spell'].replace('0','N')
df['Dry Spell'] = df['Dry Spell'].replace('no','N')
df['Dry Spell'] = df['Dry Spell'].replace('n','N')

In [23]:
df['Cold Wave'].unique()

array(['Y', 'N', '0'], dtype=object)

In [24]:
df['Cold Wave'] = df['Cold Wave'].replace('Yes','Y')
df['Cold Wave'] = df['Cold Wave'].replace('No','N')
df['Cold Wave'] = df['Cold Wave'].replace('0','N')

In [25]:
df['Wet Spell'].unique()

array(['N', 'no', 'Y', 'y'], dtype=object)

In [26]:
df['Wet Spell'] = df['Wet Spell'].replace('y','Y')
df['Wet Spell'] = df['Wet Spell'].replace('No','N')
df['Wet Spell'] = df['Wet Spell'].replace('no','N')

In [27]:
df3['Irrigation'].unique()

array(['Y', 'N', 'No', 'yes'], dtype=object)

In [28]:
df3['Irrigation'] = df3['Irrigation'].replace('Yes','Y')
df3['Irrigation'] = df3['Irrigation'].replace('No','N')
df3['Irrigation'] = df3['Irrigation'].replace('yes','Y')

In [29]:
df3['Crop Damage'].unique()

array([1., 0.])

In [30]:
df3['Crop Damage'] = df3['Crop Damage'].replace(1.0,'Y')
df3['Crop Damage'] = df3['Crop Damage'].replace(0.0,'N')

In [31]:
df.head()

,Year,Location,Avg Min Temp *C,Yr Rain mm,Heat Wave,Dry Spell,Cold Wave,Wet Spell
0,1980,Lake Diane,20.2,731.72066,N,N,Y,N
1,1980,Hillport,23.1,617.77118,N,N,Y,N
2,1980,Spencerborough,21.1,1170.91968,N,N,N,N
3,1981,Lake Diane,19.6,793.69158,N,N,Y,N
4,1981,Hillport,23.1,616.65104,N,N,Y,N

In [32]:
df3.head()

  Irrigation Crop Type Crop Damage    Yield          Observer
0          Y    Barley           Y  1618.37    Mark Henderson
1          Y    Barley           Y  1728.69  Jacqueline Jones
2          N    Barley           N  1496.14        Rita Curry
3          Y      Oats           Y   887.85      Karen Moreno
4          Y      Oats           Y  1028.50    Katie Martinez

###### Create and save data_clean.csv

In [33]:
result = pd.concat([df, df3], axis=1, join='inner')
result.head()

,Year,Location,Avg Min Temp *C,Yr Rain mm,Heat Wave,Dry Spell,Cold Wave,Wet Spell,Irrigation,Crop Type,Crop Damage,Yield,Observer
0,1980,Lake Diane,20.2,731.72066,N,N,Y,N,Y,Barley,Y,1618.37,Mark Henderson
1,1980,Hillport,23.1,617.77118,N,N,Y,N,Y,Barley,Y,1728.69,Jacqueline Jones
2,1980,Spencerborough,21.1,1170.91968,N,N,N,N,N,Barley,N,1496.14,Rita Curry
3,1981,Lake Diane,19.6,793.69158,N,N,Y,N,Y,Oats,Y,887.85,Karen Moreno
4,1981,Hillport,23.1,616.65104,N,N,Y,N,Y,Oats,Y,1028.50,Katie Martinez

In [34]:
result.to_csv('data_clean.csv',index=False)

### Summary of task_1
- __data_1_env.csv__
      There are 45 records, here temperature is *F, and the year rain in inches. Those need to convert.
- __data_2_env.csv__
      There are 75 records.